myna123/NrfProWykysa/Sources/I2C_MKL25Z4.c
/* -----------------------------------------------------------------------------
 * Copyright (c) 2013-2014 ARM Ltd.
 *
 * This software is provided 'as-is', without any express or implied warranty.
 * In no event will the authors be held liable for any damages arising from
 * the use of this software. Permission is granted to anyone to use this
 * software for any purpose, including commercial applications, and to alter
 * it and redistribute it freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software in
 *    a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 *
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 *
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *
 * $Date:        31. July 2015
 * $Revision:    V1.00
 *
 * Driver:       Driver_I2C0, Driver_I2C1
 * Configured:   via RTE_Device.h configuration file
 * Project:      I2C Driver for Freescale MKL25Z4
 * Limitations: Only Master mode is supported, slave mode is not implemented!
 * Only 7-bit address is supported.
 * -----------------------------------------------------------------------------
 * Use the following configuration settings in the middleware component
 * to connect to this driver.
 *
 *   Configuration Setting               Value     I2C Interface
 *   ---------------------               -----     -------------
 *   Connect to hardware via Driver_I2C# = 0       use I2C0
 *   Connect to hardware via Driver_I2C# = 1       use I2C1
 * -------------------------------------------------------------------------- */

/* History:
 *  Version 1.01
 *    - ...
 *  Version 1.00
 *    - First version based on Keil driver for NXP LPC18xx V2.01
 *    Only Master mode supported.
 */

/* Notes:
 * Driver uses HAL from Freescale Kinetis SDK for handling device registers.
 * The CMSIS principle of working with I2C:
 * There are 2 scenarios for MasterTransmit:
 * - master only sends data to slave (a command), no data expected from slave
 * - master wants some data from slave and sends command to get these data. Master
 * must first send the command without ending the transaction. Then it sends
 * repeated START and receives data - this is initiated by call to MasterReceive.
 */

#include <string.h>

#include "I2C_MKL25Z4.h"   //#include "I2C_LPC18xx.h"
#include "fsl_i2c_hal.h"	// jd: KSDK HAL functions for handling I2C registers

#include "Driver_I2C.h"
#include "pins_MKL25Z4.h"

#include "RTE_Device.h"

#define ARM_I2C_DRV_VERSION ARM_DRIVER_VERSION_MAJOR_MINOR(1,00) /* driver version */



/**
  \fn          uint32_t GetClockFreq (uint32_t clk_src)
  \brief       Return the clock for I2C; in manual it is always bus clock on KL25Z4.
  BUT  in KSDK it is bus clock for I2C0 and system clock (core) for I2C1! see CLOCK_SYS_GetI2cFreq.
  \note  TODO: This could be moved to general file, e.g. clock_mkl25z4.h and use enum for clock src instead of
  I2C_Resources
   We rely on values of bus clock defined in system_MKL24Z4.h file. Hope it will not change.
*/
static uint32_t GetClockFreq (I2C_RESOURCES* i2c)
{
	uint32_t clk = 20971520u;	// preset default clock
#if (CLOCK_SETUP == 0)
	clk = 20971520u;
#elif (CLOCK_SETUP == 1 || CLOCK_SETUP == 4)
	if ( i2c->reg == I2C0 )
		clk = 24000000;	// 24 MHz
	else
		clk = 48000000;
#elif (CLOCK_SETUP == 2)
	if ( i2c->reg == I2C0 )
		clk = 800000;	// 0.8 MHz
	else
		clk = 4000000;
#elif (CLOCK_SETUP == 3)
	if ( i2c->reg == I2C0 )
		clk = 1000000;	// 1 MHz
	else
		clk = 4000000;	// 4 MHz
#else
	#warning CLOCK_SETUP not available for I2C driver. Assuming default bus clock 20.97152MHz.
	// using preset default clock
#endif
	return clk;
}


/* Driver Version */
static const ARM_DRIVER_VERSION DriverVersion = {
  ARM_I2C_API_VERSION,
  ARM_I2C_DRV_VERSION
};

/* Driver Capabilities */
static const ARM_I2C_CAPABILITIES DriverCapabilities = {
  0            /* supports 10-bit addressing */
};


#if (RTE_I2C0)
/* I2C0 Control Information */
static I2C_CTRL I2C0_Ctrl = { 0 };

/* I2C0 Resources */
static I2C_RESOURCES I2C0_Resources = {
  I2C0,		/* registers of the I2C module instance for this driver */
  I2C0_IRQn,
  &SIM->SCGC4, // jd: register where clock for i2c is enabled
  &I2C0_Ctrl
};
#endif /* RTE_I2C0 */


#if (RTE_I2C1)
/* I2C1 Control Information */
static I2C_CTRL I2C1_Ctrl = { 0 };

/* I2C1 Resources */
static I2C_RESOURCES I2C1_Resources = {
  I2C1,		/* registers of the I2C module instance for this driver */
  I2C1_IRQn,
  &SIM->SCGC4,
  &I2C1_Ctrl
};
#endif /* RTE_I2C1 */

/**
  \fn          ARM_DRIVER_VERSION I2C_GetVersion (void)
  \brief       Get driver version.
  \return      \ref ARM_DRIVER_VERSION
*/
static ARM_DRIVER_VERSION I2C_GetVersion (void) {
  return DriverVersion;
}

/**
  \fn          ARM_I2C_CAPABILITIES I2C_GetCapabilities (void)
  \brief       Get driver capabilities.
  \return      \ref ARM_I2C_CAPABILITIES
*/
static ARM_I2C_CAPABILITIES I2C_GetCapabilities (void) {
  return DriverCapabilities;
}

/**
  \fn          int32_t I2Cx_Initialize (ARM_I2C_SignalEvent_t cb_event,
                                        I2C_RESOURCES         *i2c)
  \brief       Initialize I2C Interface.
  \param[in]   cb_event  Pointer to \ref ARM_I2C_SignalEvent
  \param[in]   i2c   Pointer to I2C resources
  \return      \ref execution_status
  \note			It enables the clock in SIM for the ports of the pin used by the driver.
*/
static int32_t I2Cx_Initialize (ARM_I2C_SignalEvent_t cb_event, I2C_RESOURCES *i2c) {

  if (i2c->ctrl->flags & I2C_FLAG_POWER) {
    /* Driver initialize not allowed */
    return ARM_DRIVER_ERROR;
  }
  if (i2c->ctrl->flags & I2C_FLAG_INIT) {
    /* Driver already initialized */
    return ARM_DRIVER_OK;
  }
  i2c->ctrl->flags = I2C_FLAG_INIT;

  /* Register driver callback function */
  i2c->ctrl->cb_event = cb_event;

