myna123/NrfProWykysa/Sources/I2C_MKL25Z4.c
  /* Configure I2C Pins */
  if (i2c->reg == I2C0) {
	  // Enable clock for the pins port
	  PINS_EnablePinPortClock(RTE_I2C0_SCL_PIN);
	  PINS_EnablePinPortClock(RTE_I2C0_SDA_PIN);

	  // Set pin function to I2C
	  PINS_PinConfigure(RTE_I2C0_SCL_PIN, RTE_I2C0_SCL_FUNC);
	  PINS_PinConfigure(RTE_I2C0_SDA_PIN, RTE_I2C0_SDA_FUNC);

  }
  else if (i2c->reg == I2C1) {
	  PINS_EnablePinPortClock(RTE_I2C1_SCL_PIN);
	  PINS_EnablePinPortClock(RTE_I2C1_SDA_PIN);
	  PINS_PinConfigure(RTE_I2C1_SCL_PIN, RTE_I2C1_SCL_FUNC);
	  PINS_PinConfigure(RTE_I2C1_SDA_PIN, RTE_I2C1_SDA_FUNC);
  }

  /* Clear driver status */
  memset (&i2c->ctrl->status, 0, sizeof(ARM_I2C_STATUS));

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t I2Cx_Uninitialize (I2C_RESOURCES *i2c)
  \brief       De-initialize I2C Interface.
  \param[in]   i2c   Pointer to I2C resources
  \return      \ref execution_status
*/
static int32_t I2Cx_Uninitialize (I2C_RESOURCES *i2c) {

  if (!(i2c->ctrl->flags & I2C_FLAG_INIT)) {
    /* Driver not initialized */
    return ARM_DRIVER_OK;
  }
  if (i2c->ctrl->flags & I2C_FLAG_POWER) {
    /* Driver needs POWER_OFF first */
    return ARM_DRIVER_ERROR;
  }
  i2c->ctrl->flags = 0;

  /* Unconfigure SCL and SDA pins */
  if (i2c->reg == I2C0) {
 	  PINS_PinConfigure(RTE_I2C0_SCL_PIN, 0);
 	  PINS_PinConfigure(RTE_I2C0_SDA_PIN, 0);
   }
   else if (i2c->reg == I2C1) {
 	  PINS_PinConfigure(RTE_I2C1_SCL_PIN, 0);
 	  PINS_PinConfigure(RTE_I2C1_SDA_PIN, 0);
   }


  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t I2Cx_PowerControl (ARM_POWER_STATE state,
                                          I2C_RESOURCES   *i2c)
  \brief       Control I2C Interface Power.
  \param[in]   state  Power state
  \param[in]   i2c    Pointer to I2C resources
  \return      \ref execution_status
*/
static int32_t I2Cx_PowerControl (ARM_POWER_STATE state, I2C_RESOURCES *i2c) {

  if (!(i2c->ctrl->flags & I2C_FLAG_INIT)) {
    /* Driver not initialized */
    return ARM_DRIVER_ERROR;
  }

  switch (state) {
    case ARM_POWER_OFF:
      if (!(i2c->ctrl->flags & I2C_FLAG_POWER)) {
        /* Driver not powered */
        break;
      }
      if (i2c->ctrl->status.busy) {
        /* Transfer operation in progress */
        return ARM_DRIVER_ERROR_BUSY;
      }
      i2c->ctrl->flags = I2C_FLAG_INIT;

      /* Disable I2C interrupts */
      NVIC_DisableIRQ (i2c->i2c_ev_irq);

      I2C_HAL_SetIntCmd(i2c->reg, false);	/* jd: disable interrupts in i2c module*/

      /* Disable I2C Operation */
      /* Use Kinetis SDK HALL: */
      I2C_HAL_Disable(i2c->reg);

      /* Disable I2C peripheral clock */
      if (i2c->reg == I2C0) {
    	  *i2c->pclk_cfg_reg &= ~SIM_SCGC4_I2C0_MASK;
      } else if (i2c->reg == I2C1) {
    	  *i2c->pclk_cfg_reg &= ~SIM_SCGC4_I2C1_MASK;
      }

      break;

    case ARM_POWER_FULL:
      if (i2c->ctrl->flags & I2C_FLAG_POWER) {
        /* Driver already powered */
        break;
      }

      /* Enable I2C peripheral clock */
      if (i2c->reg == I2C0) {
    	  *i2c->pclk_cfg_reg |= SIM_SCGC4_I2C0_MASK;
      } else if (i2c->reg == I2C1) {
    	  *i2c->pclk_cfg_reg |= SIM_SCGC4_I2C1_MASK;
      }
      // jd: TODO: wait for clock running?

      /* Reset I2C peripheral */
      /*jd: not available on KL25
      LPC_RGU->RESET_CTRL1 = i2c->rgu_val;
      while (!(LPC_RGU->RESET_ACTIVE_STATUS1 & i2c->rgu_val));
      */

      /* Enable I2C Operation */
      // KSDK version:
      I2C_HAL_Init(i2c->reg);

      i2c->ctrl->stalled = 0;
      //i2c->ctrl->con_aa  = 0;

      /* Enable I2C interrupts */
      NVIC_ClearPendingIRQ (i2c->i2c_ev_irq);
      NVIC_EnableIRQ (i2c->i2c_ev_irq);

      I2C_HAL_Enable(i2c->reg);
      I2C_HAL_SetIntCmd(i2c->reg, true);	/* jd: enable interrupts in i2c module*/

      i2c->ctrl->flags |= I2C_FLAG_POWER;
      break;

    default:
      return ARM_DRIVER_ERROR_UNSUPPORTED;
  }

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t I2Cx_MasterTransmit (uint32_t       addr,
                                            const uint8_t *data,
                                            uint32_t       num,
                                            bool           xfer_pending,
                                            I2C_RESOURCES *i2c)
  \brief       Start transmitting data as I2C Master.
  \param[in]   addr          Slave address (7-bit only! 10-bit not supported)
  \param[in]   data          Pointer to buffer with data to transmit to I2C Slave
  \param[in]   num           Number of data bytes to transmit
  \param[in]   xfer_pending  Transfer operation is pending - Stop condition will not be generated
  \param[in]   i2c           Pointer to I2C resources
  \return      \ref execution_status
*/
static int32_t I2Cx_MasterTransmit (uint32_t       addr,
                                    const uint8_t *data,
                                    uint32_t       num,
                                    bool           xfer_pending,
                                    I2C_RESOURCES *i2c) {

	/* Note: MasterTransmit always uses 0 value of r/w bit (= send).
	 Bit r/w - read is 1, write is 0. */

 /* jd: num == 0 is valid request to send just slave address
  with no data (and write bit) */
  if (!data || /*!num ||*/ (addr > 0x7F)) {
    /* Invalid parameters */
    return ARM_DRIVER_ERROR_PARAMETER;
  }

  if (!(i2c->ctrl->flags & I2C_FLAG_SETUP)) {
    /* Driver not yet configured */
    return ARM_DRIVER_ERROR;
  }

  if (i2c->ctrl->status.busy || (i2c->ctrl->stalled & I2C_SLAVE)) {
    /* Transfer operation in progress, or Slave stalled */
    return ARM_DRIVER_ERROR_BUSY;
  }

  //NVIC_DisableIRQ (i2c->i2c_ev_irq);
  I2C_HAL_SetIntCmd(i2c->reg, false);

  /* Set control variables */
  i2c->ctrl->sla_rw  = addr << 1;	// jd: zde vzdy posilame RW bit = 0 tj. write
  i2c->ctrl->pending = xfer_pending;
  i2c->ctrl->data    = (uint8_t *)data;
  i2c->ctrl->num     = num;
  i2c->ctrl->cnt     = -1;

