myna123/NrfProWykysa/Sources/I2C_MKL25Z4.c
  /* Update driver status */
  i2c->ctrl->status.busy             = 1;
  i2c->ctrl->status.mode             = 1;		/* 1 = master */
  i2c->ctrl->status.direction        = 0;		/* 0 = transmit, 1 = receive */
  i2c->ctrl->status.arbitration_lost = 0;
  i2c->ctrl->status.bus_error        = 0;
  if (!i2c->ctrl->stalled) {
	  // jd: from KSDK
	  /* Set direction to send for sending of address and data. */
	  I2C_HAL_SetDirMode(i2c->reg, kI2CSend);
	  I2C_HAL_SendStart(i2c->reg);		// also sets I2C to master mode if not already set
	  // Note: 1 byte transmitted to trigger interrupt is not included in  i2c->ctrl->num,
	  // this 1st byte is the slave address
	  i2c->ctrl->cnt = 0;	// this is used as index to data buffer in ISR
	  I2C_HAL_WriteByte(i2c->reg, i2c->ctrl->sla_rw);	/* Send slave address */
	  /* For Kinetis we need to send first byte (slave address) to get an interrupt; it seems LPC just
	   * needs to send start to trigger interrupt. */
  }
  /* Note: if already stalled is handled in error check above */

  //NVIC_EnableIRQ (i2c->i2c_ev_irq);
  //I2C_HAL_ClearInt(i2c->reg);
  I2C_HAL_SetIntCmd(i2c->reg, true);

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t I2Cx_MasterReceive (uint32_t       addr,
                                           uint8_t       *data,
                                           uint32_t       num,
                                           bool           xfer_pending,
                                           I2C_RESOURCES *i2c)
  \brief       Start receiving data as I2C Master.
  \param[in]   addr          Slave address (7-bit or 10-bit)
  \param[out]  data          Pointer to buffer for data to receive from I2C Slave
  \param[in]   num           Number of data bytes to receive
  \param[in]   xfer_pending  Transfer operation is pending - Stop condition will not be generated
  \param[in]   i2c           Pointer to I2C resources
  \return      \ref execution_status
*/
static int32_t I2Cx_MasterReceive (uint32_t       addr,
                                   uint8_t       *data,
                                   uint32_t       num,
                                   bool           xfer_pending,
                                   I2C_RESOURCES *i2c) {

  if (!data || !num || (addr > 0x7F)) {
    /* Invalid parameters */ 
    return ARM_DRIVER_ERROR_PARAMETER;
  }

  if (!(i2c->ctrl->flags & I2C_FLAG_SETUP)) {
    /* Driver not yet configured */
    return ARM_DRIVER_ERROR;
  }

  if (i2c->ctrl->status.busy || (i2c->ctrl->stalled & I2C_SLAVE)) {
    /* Transfer operation in progress, or Slave stalled */
    return ARM_DRIVER_ERROR_BUSY;
  }

  //NVIC_DisableIRQ (i2c->i2c_ev_irq);
  I2C_HAL_SetIntCmd(i2c->reg, false);

  /* Set control variables */
  i2c->ctrl->sla_rw  = (addr << 1) | 0x01;	// Address with Read bit
  i2c->ctrl->pending = xfer_pending;
  i2c->ctrl->data    = data;
  i2c->ctrl->num     = num;
  i2c->ctrl->cnt     = -1;

  /* Update driver status */
  i2c->ctrl->status.busy             = 1;
  i2c->ctrl->status.mode             = 1;
  i2c->ctrl->status.direction        = 0;	/* 0 = transmit, 1 = receive */
  i2c->ctrl->status.arbitration_lost = 0;
  i2c->ctrl->status.bus_error        = 0;

  /* If not stalled, it means we do not generate RE-START, this is simple
     master receive operation: send slave address and slave responds with data */
  /* Note that because we must always generate START or RE-START, the code for
     stalled and not stalled version is the same */

	I2C_HAL_SetDirMode(i2c->reg, kI2CSend); /* sending address */
	I2C_HAL_SendStart(i2c->reg);
	I2C_HAL_WriteByte(i2c->reg, i2c->ctrl->sla_rw); /* Send slave address */
	i2c->ctrl->cnt = 0;	// received 0 bytes of data so far

	//NVIC_EnableIRQ (i2c->i2c_ev_irq);
	I2C_HAL_SetIntCmd(i2c->reg, true);

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t I2Cx_SlaveTransmit (const uint8_t *data,
                                           uint32_t       num,
                                           I2C_RESOURCES *i2c)
  \brief       Start transmitting data as I2C Slave.
  \param[in]   data  Pointer to buffer with data to transmit to I2C Master
  \param[in]   num   Number of data bytes to transmit
  \param[in]   i2c   Pointer to I2C resources
  \return      \ref execution_status
*/
static int32_t I2Cx_SlaveTransmit (const uint8_t *data,
                                   uint32_t       num,
                                   I2C_RESOURCES *i2c) {

  if (!data || !num) {
    /* Invalid parameters */
    return ARM_DRIVER_ERROR_PARAMETER;
  }

  if (i2c->ctrl->status.busy || (i2c->ctrl->stalled & (I2C_MASTER | I2C_SLAVE_RX))) {
    /* Transfer operation in progress, Master stalled or Slave receive stalled */
    return ARM_DRIVER_ERROR_BUSY;
  }

  NVIC_DisableIRQ (i2c->i2c_ev_irq);

  /* Set control variables */
  i2c->ctrl->flags &= ~I2C_FLAG_SLAVE_RX;
  i2c->ctrl->sdata  = (uint8_t *)data;
  i2c->ctrl->snum   = num;
  i2c->ctrl->cnt    = -1;

  /* Update driver status */
  i2c->ctrl->status.general_call = 0;
  i2c->ctrl->status.bus_error    = 0;

  NVIC_EnableIRQ (i2c->i2c_ev_irq);

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t I2Cx_SlaveReceive (uint8_t       *data,
                                          uint32_t       num,
                                          I2C_RESOURCES *i2c)
  \brief       Start receiving data as I2C Slave.
  \param[out]  data  Pointer to buffer for data to receive from I2C Master
  \param[in]   num   Number of data bytes to receive
  \param[in]   i2c   Pointer to I2C resources
  \return      \ref execution_status
*/
static int32_t I2Cx_SlaveReceive (uint8_t       *data,
                                  uint32_t       num,
                                  I2C_RESOURCES *i2c) {

  if (!data || !num) {
    /* Invalid parameters */ 
    return ARM_DRIVER_ERROR_PARAMETER;
  }

  if (i2c->ctrl->status.busy || (i2c->ctrl->stalled & (I2C_MASTER | I2C_SLAVE_TX))) {
    /* Transfer operation in progress, Master stalled or Slave transmit stalled */
    return ARM_DRIVER_ERROR_BUSY;
  }

  NVIC_DisableIRQ (i2c->i2c_ev_irq);

