myna123/NrfProWykysa/Sources/I2C_MKL25Z4.c
  /* Set control variables */
  i2c->ctrl->flags |= I2C_FLAG_SLAVE_RX;
  i2c->ctrl->sdata  = data;
  i2c->ctrl->snum   = num;
  i2c->ctrl->cnt    = -1;

  /* Update driver status */
  i2c->ctrl->status.general_call = 0;
  i2c->ctrl->status.bus_error    = 0;

  NVIC_EnableIRQ (i2c->i2c_ev_irq);

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t I2Cx_GetDataCount (I2C_RESOURCES *i2c)
  \brief       Get transferred data count.
  \return      number of data bytes transferred; -1 when Slave is not addressed by Master
*/
static int32_t I2Cx_GetDataCount (I2C_RESOURCES *i2c) {
  return (i2c->ctrl->cnt);
}

/**
  \fn          int32_t I2Cx_Control (uint32_t       control,
                                     uint32_t       arg,
                                     I2C_RESOURCES *i2c)
  \brief       Control I2C Interface.
  \param[in]   control  operation
  \param[in]   arg      argument of operation (optional)
  \param[in]   i2c      pointer to I2C resources
  \return      \ref execution_status
*/
static int32_t I2Cx_Control (uint32_t control, uint32_t arg, I2C_RESOURCES *i2c) {
  uint32_t val, clk;	// conset;
  //uint8_t mul, icr;

  if (!(i2c->ctrl->flags & I2C_FLAG_POWER)) {
    /* Driver not powered */
    return ARM_DRIVER_ERROR;
  }
  switch (control) {
    case ARM_I2C_OWN_ADDRESS:
      /* Set Own Slave Address */
      val = (arg << 1) & 0xFF;
      if (arg & ARM_I2C_ADDRESS_GC) {
        /* General call enable */
    	I2C_HAL_SetGeneralCallCmd(i2c->reg, true);
      }
      else {
    	  // jd: added else to disable general call
    	  I2C_HAL_SetGeneralCallCmd(i2c->reg, false);
      }

      i2c->reg->A1 = val;		// jd: 7-bit address; same as on LPC18xx


      /* Enable assert acknowledge */
      if ( val )
    	  i2c->reg->C1 &= ~I2C_C1_TXAK_MASK;	// enable ACK
      // KSDK has only I2C_HAL_SendAck which does the same
      break;

    case ARM_I2C_BUS_SPEED:
      /* Set Bus Speed */
      clk = GetClockFreq (i2c);
      switch (arg) {
        case ARM_I2C_BUS_SPEED_STANDARD:
          /* Standard Speed (100kHz) */
          //clk /= 100000;
          I2C_HAL_SetBaudRate(i2c->reg, clk, 100, NULL);
          break;
        case ARM_I2C_BUS_SPEED_FAST:
          /* Fast Speed     (400kHz) */
          //clk /= 400000;
          I2C_HAL_SetBaudRate(i2c->reg, clk, 400, NULL);
          break;
#if 0	/* jd: not supported for now */
        case ARM_I2C_BUS_SPEED_FAST_PLUS:
          /* Fast+ Speed    (  1MHz) */
          if (i2c->reg == LPC_I2C0) {
            clk /= 1000000;
            break;
          }
#endif
        default:
          return ARM_DRIVER_ERROR_UNSUPPORTED;
      }
      /* jd: MUL * ICR = BUS/Baud
       * clk is now BUS/Baud
       * ICR must fit 6 bits -> ICR < 63 (0x3F)
       * Max bus clock is 24 MHz, with min speed 100 kHz this gives:
       * MUL * ICR = 24000000 / 100000 = 240
       * So we need to use MUL "dynamically", it cannot be 1 for all cases.
       * */
#if 0	/* replaced by KSDK HAL I2C_HAL_SetBaudRate */
      mul = 1;
      tmp_clk = clk;
      while ( (tmp_clk > 63) && (mult < 4)  )
      {
    	  tmp_clk = clk;
    	  mul = mul << 1;
    	  tmp_clk = tpm_clk / mul;	// try ICR value with this mult
      }
      icr = (uint8_t)(clk/mul);	// now calculate the real value of ICR
      i2c->reg->F = (((mul-1) < 6) | icr);
#endif


      /* Speed configured, I2C Master active */
      i2c->ctrl->flags |= I2C_FLAG_SETUP;
      break;

    case ARM_I2C_BUS_CLEAR:
      /* Execute Bus clear */
      return ARM_DRIVER_ERROR_UNSUPPORTED;

    case ARM_I2C_ABORT_TRANSFER:
      /* Abort Master/Slave transfer */
      //NVIC_DisableIRQ (i2c->i2c_ev_irq);
      I2C_HAL_SetIntCmd(i2c->reg, false);	/* disable interrupts */

      i2c->ctrl->status.busy = 0;
      i2c->ctrl->stalled = 0;
      i2c->ctrl->snum    = 0;
      /* Master: send STOP to I2C bus           */
      /* Slave:  enter non-addressed Slave mode */
      // jd: writing STO in master mode sends STOP signal to bus,
      // in slave mode it recovers from error condition.
      I2C_HAL_SendStop(i2c->reg);
      I2C_HAL_SetIntCmd(i2c->reg, true);	/* disable interrupts */
      //NVIC_EnableIRQ (i2c->i2c_ev_irq);
      break;

    default:
      return ARM_DRIVER_ERROR_UNSUPPORTED;
  }
  return ARM_DRIVER_OK;
}

/**
  \fn          ARM_I2C_STATUS I2Cx_GetStatus (I2C_RESOURCES *i2c)
  \brief       Get I2C status.
  \param[in]   i2c      pointer to I2C resources
  \return      I2C status \ref ARM_I2C_STATUS
*/
static ARM_I2C_STATUS I2Cx_GetStatus (I2C_RESOURCES *i2c) {
  return (i2c->ctrl->status);
}

/**
  \fn          void I2Cx_MasterHandler (I2C_RESOURCES *i2c)
  \brief       I2C Master state event handler.
  \param[in]   i2c  Pointer to I2C resources
  \return      I2C event notification flags. This will be given to user callback if defined.
*/
static uint32_t I2Cx_MasterHandler (I2C_RESOURCES *i2c)
{
  uint32_t event  = 0;

  /* Clear the interrupt flag*/
  I2C_HAL_ClearInt(i2c->reg);

   	/* ERROR: Bus error, timeout? */
  	/*  LPC event: I2C_STAT_BUSERR */
  	if (!I2C_HAL_GetStatusFlag(i2c->reg, kI2CBusBusy)) {
  		/* If no transfer in progress */
  		i2c->ctrl->status.bus_error = 1;
  		i2c->ctrl->status.busy = 0;
  		i2c->ctrl->status.mode = 0;
  		event = ARM_I2C_EVENT_BUS_ERROR |
  		ARM_I2C_EVENT_TRANSFER_DONE |
  		ARM_I2C_EVENT_TRANSFER_INCOMPLETE;
  		return (event);	// nothing else to do
  	}

    /* ERROR: Arbitration lost */
  	if ( I2C_HAL_GetStatusFlag(i2c->reg, kI2CArbitrationLost) )	{
  	      i2c->ctrl->status.arbitration_lost = 1;
  	      i2c->ctrl->status.busy             = 0;
  	      i2c->ctrl->status.mode             = 0;
  	      event = ARM_I2C_EVENT_ARBITRATION_LOST |
  	              ARM_I2C_EVENT_TRANSFER_DONE    |
  	              ARM_I2C_EVENT_TRANSFER_INCOMPLETE;
  	      I2C_HAL_SetIntCmd(i2c->reg, false);
  	      I2C_HAL_SendStop(i2c->reg);
  	      I2C_HAL_ClearArbitrationLost(i2c->reg);
  	      return (event);
  	}

    /* Get current master transfer direction */
    i2c_direction_t direction = I2C_HAL_GetDirMode(i2c->reg);
	if (direction == kI2CSend)
	{ 	/* Sending data */

		/* ERROR: negative assertion (NACK) received.
		 * Only important in transmit mode; in receive mode we generate ACK/NACK. */
		if (I2C_HAL_GetStatusFlag(i2c->reg, kI2CReceivedNak)) {
			/* Record that we got a NAK */
			i2c->ctrl->status.busy = 0;
			i2c->ctrl->status.mode = 0;
			event = ARM_I2C_EVENT_ADDRESS_NACK |
					ARM_I2C_EVENT_TRANSFER_DONE |
					ARM_I2C_EVENT_TRANSFER_INCOMPLETE;
			/* Note: we do not know if it is address or data NACK and there is
			 * no code for data NACK in Drivee_I2C anyway*/
			/* Got a NACK, so we're done with this transfer */
			I2C_HAL_SetIntCmd(i2c->reg, false);
			I2C_HAL_SendStop(i2c->reg);
			return (event);
		}

		if (i2c->ctrl->stalled == I2C_MASTER
				|| (i2c->ctrl->sla_rw & 0x01) ) {
			/* Stalled means MasterTransmit was called earlier with pending = true
			 * and this is 1st call to MasterReceive afterwards.  This is I2C transfer
			 * with repeated start sending.
			 * Another case is "normal" I2C read; MasterTransmit sends slave address with
			 * Write bit and we now need to switch to receive mode to get answer from slave. */

			/* Switch to receive mode*/
			I2C_HAL_SetDirMode(i2c->reg, kI2CReceive);
			i2c->ctrl->status.direction = 1;	/* 0 = transmit, 1 = receive */

			/* Initiate read from slave */
			/* If we want only 1 byte, we need to set NACK before reading */
			if (i2c->ctrl->num == 1 )
				I2C_HAL_SendNak(i2c->reg);
			else
				I2C_HAL_SendAck(i2c->reg);

